/**
 * Функция принимает два множества и проверяет,
 * является ли второе множество подмножеством первого.
 * Если это так - возвращает true, иначе false.
 *
 * Для решения использовать Set.
 *
 * @param {Set} mainSet
 * @param {Set} subSet
 */

function isSubarray(mainSet, subSet) {}

/**
 * Функция принимает строку с текстом. Словом считается последовательность
 * непробельных символов идущих подряд, слова разделены одним или большим
 * числом пробелов или символами конца строки, а также знаками препинания (.,!?-:;).
 *
 * Определить, сколько различных слов содержится в этом тексте и вернуть это кол-во.
 *
 * Не забудьте сделать решение регистронезависимым ;)
 *
 * Для решения использовать Set.
 *
 * @param {string} text
 */

function countUniqueWords(text) {}

module.exports = {
  isSubarray,
  countUniqueWords
};
